app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "han"], ["email", "bin315a1@gmail.com"], ["password", "password"], ["created_at", "2019-10-24 00:41:05.040883"], ["updated_at", "2019-10-24 00:41:05.040883"]]
---
  def create
    @user = User.new(user_params)
    if @user.save